Revit 2027 API
FabricationPartSizeMap.SizeString Property
 The size display string for the straight that can be used by the user interface.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SizeString { get; set; }
Public Property SizeString As String
	Get
	Set
public:
property String^ SizeString {
	String^ get ();
	void set (String^ value);
}
member SizeString : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace